Repository: ThiagoAZBR/innominatus_ai
Catalog: lib/app/shared/l10n/app_*.arb
Languages: es, fr, pt

# splashPageCreateYourWayThroughChaos
source: Create your unique way of learning through Chaos
es: Crea tu propia manera de estudiar a través del Chaos
fr: Créez votre propre manière d'étudier à travers le Chaos
pt: Crie sua própria maneira de estudar através do Chaos

# splashPageLetsStart
source: Let's get started!
es: ¡Vamos a empezar!
fr: Commençons !
pt: Vamos Começar!

# homeAskChaos
source: Ask to Chaos
es: Pregúntale al Chaos
fr: Demandez à Chaos
pt: Pergunte ao Chaos

# homeViewStudyPlan
source: View Study Plan
es: Ver Plan de Estudios
fr: Voir le plan d'études
pt: Ver Plano de Estudos

# homeViewStudyPlanDescription
source: Check your study plan! Your chosen field of study and subjects.
es: ¡Consulta tu plan de estudios! Tu área de estudio elegida y asignaturas.
fr: Consultez votre plan d'études ! Votre domaine d'étude choisi et vos matières.
pt: Verifique seu plano de estudos! Sua área de estudo escolhida e disciplinas.

# homeStartStudy
source: Start studies
es: Comenzar estudios
fr: Commencer les études
pt: Iniciar estudos

# homeStartStudyDescription
source: Here, you will choose what you want to learn and kickstart your studies
es: Aquí elegirás lo que deseas aprender y darás el primer paso en tus estudios.
fr: Vous allez choisir ce que vous voulez apprendre et donner le coup d'envoi à vos études ici !
pt: Aqui você irá escolher o que deseja aprender e dar o pontapé inicial nos seus estudos!

# homeHello
source: Hello,
es: Hola,
fr: Bonjour,
pt: Olá,

# homeHelloDescription
source: It's nice to see you here.
es: Es bueno tenerte aquí.
fr: Content de vous voir ici.
pt: É bom ter você aqui.

# homeLoadAppInfo
source: Loading app content...
es: Cargando información de la aplicación...
fr: Chargement des informations de l'application...
pt: Carregando informações do aplicativo...

# chatTextFieldHint
source: Message...
es: Mensaje...
pt: Mensagem...

# chatErrorGeneratingContent
source: Occur an error when trying to generate response. Please, try again!
es: Se produjo un error al intentar generar tu respuesta. ¡Por favor, inténtalo de nuevo!
fr: Une erreur s'est produite lors de la génération de votre réponse. Veuillez réessayer !
pt: Ocorreu um erro ao tentar gerar a sua resposta. Por favor, tente novamente!

# chatLimitNonPremiumUsers
source: You limit of questions was made today... Subscribe Chaos IO Premium plan to receive many benefits, including the end of daily question limits!
es: Tu límite de preguntas se alcanzó hoy... ¡Suscríbete a la versión Premium de Chaos IO para recibir varios beneficios, incluida la eliminación de los límites diarios de preguntas!
fr: Votre limite de questions a été atteinte pour aujourd'hui... Abonnez-vous à la version Premium de Chaos IO pour bénéficier de divers avantages, notamment la suppression des limites quotidiennes de questions !
pt: Seu limite de perguntas foi atingido por hoje... Assine a versão Premium do Chaos IO para receber diversos benefícios, entre eles, o fim dos limites diários de perguntas!

# studyPlanIsEditing
source: You are editing your study plan
es: Estás editando tu plan de estudios
fr: Vous êtes en train de modifier votre plan d'études
pt: Você está editando seu plano de estudos

# studyPlanSelectSubjectToAccessClasses
source: Select a subject to access its classes
es: Selecciona una asignatura para acceder a tus clases
fr: Sélectionnez une matière pour accéder à vos cours
pt: Selecione uma disciplina para acessar suas aulas

# studyPlanStopEditingToAccessSubjects
source: Click 'Stop Editing' to access the content of the subjects
es: Haz clic en 'Dejar de editar' para poder acceder al contenido de las asignaturas
fr: Cliquez sur 'Arrêter de modifier' pour accéder au contenu des matières
pt: Clique em 'Parar de editar', para conseguir acessar o conteúdo das disciplinas

# studyPlanHowToAccessSubjects
source: You can select a subject by tapping on it
es: Puedes seleccionar una asignatura al tocarla
fr: Vous pouvez sélectionner une matière en appuyant dessus
pt: Você consegue selecionar uma disciplina ao tocar em cima dela

# studyPlanStopEdit
source: Stop Editing
es: Dejar de editar
fr: Arrêter de modifier
pt: Parar de Editar

# studyPlanEdit
source: Edit
es: Editar
fr: Modifier
pt: Editar

# fieldsOfStudyChooseFieldOfStudy
source: Choose a field of study
es: Elige un campo de estudio
fr: Choisissez un domaine d'étude
pt: Escolha uma área de estudo

# fieldsOfStudyHowToChooseFieldOfStudy
source: You can select a field of study by tapping on it.
es: Puedes seleccionar un campo de estudio tocándolo.
fr: Vous pouvez sélectionner un domaine d'étude en appuyant dessus.
pt: Você consegue selecionar uma área de estudo ao tocar em cima dela.

# fieldsOfStudyErrorMessage
source: An error occurred while trying to display the contents, please try again.
es: Se produjo un error al intentar mostrar el contenido. Inténtalo de nuevo.
fr: Une erreur s'est produite en essayant d'afficher le contenu, veuillez réessayer.
pt: Ocorreu um erro ao tentar mostrar os conteúdos, tente novamente.

# fieldsOfStudyLoadingMessage
source: Loading content...
es: Cargando contenido...
fr: Chargement du contenu...
pt: Carregando conteúdo...

# fieldsOfStudyLoadingMessageDescription
source: Soon, your fields of study will be ready to be selected.
es: Pronto tus campos de estudio estarán listos para ser seleccionados.
fr: Bientôt, vos domaines d'étude seront prêts à être sélectionnés.
pt: Logo, logo, suas áreas de estudo estarão prontas para serem selecionadas.

# subjectsChooseSubjects
source: Choose up to 3 Subjects
es: Elige hasta 3 materias
fr: Choisissez jusqu'à 3 matières
pt: Escolha até 3 Disciplinas

# subjectsHowToChooseSubjects
source: You can select a subject by tapping on it
es: Puedes seleccionar una materia tocándola
fr: Vous pouvez sélectionner une matière en appuyant dessus
pt: Você consegue selecionar uma disciplina ao tocar em cima dela

# subjectsLoadingMessage
source: Loading content...
es: Cargando contenido...
fr: Chargement du contenu...
pt: Carregando conteúdo...

# subjectsLoadingMessageDescription
source: Soon, your subjects will be ready to be selected.
es: Pronto tus materias estarán listas para ser seleccionadas.
fr: Bientôt, vos matières seront prêtes à être sélectionnées.
pt: Logo, logo, suas disciplinas estarão prontas para serem selecionadas.

# classesChooseYourClass
source: Choose your class
es: Elige tu clase
fr: Choisissez votre cours
pt: Escolha sua aula

# classesHowToChooseClass
source: You can select a class by tapping on it
es: Puedes seleccionar una clase tocándola
fr: Vous pouvez sélectionner un cours en appuyant dessus
pt: Você consegue selecionar uma aula ao tocar em cima dela

# classesErrorMessage
source: An error occurred while creating classes
es: Se produjo un error al crear las clases
fr: Une erreur s'est produite lors de la création des cours
pt: Ocorreu um erro na criação de aulas

# classesLoadingMessage
source: Loading content...
es: Cargando contenido...
fr: Chargement du contenu...
pt: Carregando conteúdo...

# classesLoadingMessageDescription
source: Soon, your classes will be ready to be selected.
es: Pronto tus clases estarán listas para ser seleccionadas.
fr: Bientôt, vos cours seront prêts à être sélectionnés.
pt: Logo, logo, suas aulas estarão prontas para serem selecionadas.

# classLoadingMessage
source: Your class is being created! This may take a few seconds...
es: ¡Se está creando tu clase! Esto puede llevar unos segundos...
fr: Votre cours est en cours de création ! Cela peut prendre quelques secondes...
pt: Sua aula está sendo criada! Isso pode levar alguns segundos...

# classErrorMessage
source: There was a problem generating your class! Please try again.
es: Hubo un problema al generar tu clase. Por favor, inténtalo de nuevo.
fr: Un problème est survenu lors de la génération de votre cours ! Veuillez réessayer.
pt: Ocorreu um problema no momento de geração de sua aula! Por favor, tente novamente.

# classBack
source: Back
es: Volver
fr: Retour
pt: Voltar

# classLimitOfFreePlan
source: Your daily class limit has been reached... Subscribe to the Chaos IO Premium version to receive various benefits, including the removal of daily class limits!
es: Tu límite de clases para hoy ha sido alcanzado... ¡Suscríbete a la versión Premium de Chaos IO para obtener varios beneficios, incluida la eliminación de los límites diarios de clases!
fr: Votre limite quotidienne de cours a été atteinte... Abonnez-vous à la version Premium de Chaos IO pour bénéficier de nombreux avantages, dont la suppression des limites quotidiennes de cours !
pt: Seu limite de aulas foi atingido por hoje... Assine a versão Premium do Chaos IO para receber diversos benefícios, entre eles, o fim dos limites diários de aulas!

# classRemoveLimits
source: Remove limits
es: Eliminar límites
fr: Supprimer les limites
pt: Remover limites

# premiumLoadingMessage
source: Loading subscription plan
es: Cargando plan de suscripción
fr: Chargement du plan d'abonnement
pt: Carregando plano de assinatura

# premiumErrorMessage
source: An error occurred while trying to fetch Premium Plan data
es: Se produjo un error al intentar obtener los datos del Plan Premium
fr: Une erreur s'est produite en essayant de récupérer les données du plan Premium
pt: Ocorreu um erro ao tentar pegar os dados do Plano Premium

# premiumFreedomEaseCustomization
source: Freedom, Ease, and Customization
es: Libertad, Facilidad y Personalización
fr: Liberté, Facilité et Personnalisation
pt: Liberdade, Facilidade e Personalização

# premiumFirstBenefit
source: Get unlimited access to your classes and questions
es: Obtén acceso ilimitado a tus clases y preguntas
fr: Accédez de façon illimitée à vos cours et questions
pt: Tenha acesso ilimitado as suas aulas e perguntas

# premiumSecondBenefit
source: Access classes offline
es: Accede a clases sin conexión
fr: Accédez aux cours hors ligne
pt: Acesse aulas offline

# premiumThirdBenefit
source: Total freedom in your learning
es: Libertad total en tu aprendizaje
fr: Liberté totale dans votre apprentissage
pt: Liberdade total no seu aprendizado

# premiumTryFreeForATime
source: Try free for 1 month
es: Prueba gratuita por 1 mes
fr: Essayez gratuitement pendant 1 mois
pt: Teste grátis por 1 mês

# premiumAfterPayJustPriceCancelWhenYouWant
source: Then, pay only {price}/month. Cancel anytime.
es: Luego, paga solo {price}/mes. Cancela cuando quieras.
fr: Ensuite, payez seulement {price}/mois. Annulez quand vous voulez.
pt: Depois, pague somente {price}/mês. Cancele quando quiser.

# premiumTryFree
source: Try for Free
es: Prueba gratis
fr: Essayez gratuitement
pt: Experimente Gratuitamente

# premiumBureaucraticMessage
source: Your subscription will automatically renew monthly unless canceled before. Free trial only for first subscription.
es: Tu suscripción se renovará automáticamente cada mes a menos que la canceles antes. Prueba gratuita solo para la primera suscripción.
fr: Votre abonnement se renouvellera automatiquement chaque mois sauf si annulé avant. Essai gratuit uniquement pour le premier abonnement.
pt: Sua assinatura será automaticamente renovada mensalmente a não ser que cancele antes sua assinatura. Teste gratuito apenas para primeira assinatura.

# premiumPrivacyPolice
source: Privacy Policy
es: Política de privacidad
fr: Politique de confidentialité
pt: Política de Privacidade

# premiumRestorePurchase
source: Restore purchase
es: Restaurar compra
fr: Restaurer l'achat
pt: Restaurar compra

# appWidgetsContinue
source: Continue
es: Continuar
fr: Continuer
pt: Continuar

# appWidgetsClose
source: Close
es: Cerrar
fr: Fermer
pt: Fechar

# appWidgetsHomeIcon
source: Home
es: Inicio
fr: Accueil
pt: Início

# appWidgetsStudyPlanIcon
source: Study Plan
es: Plan de estudios
fr: Plan d'études
pt: Plano de Estudos

# appWidgetsMinimizeDescription
source: Minimize description
es: Minimizar descripción
fr: Réduire la description
pt: Minimizar descrição

# appWidgetsLearnMoreAboutThisField
source: Learn more about this field
es: Conocer más sobre este campo
fr: En savoir plus sur ce domaine
pt: Conhecer mais dessa área

# dialogAppNewVersion
source: New version of Chaos IO available
es: Nueva versión de Chaos IO disponible
fr: Nouvelle version de Chaos IO disponible
pt: Nova versão do Chaos IO disponível

# dialogAppNewVersionDescription
source: Update the App to receive the latest updates and features
es: Actualiza la aplicación para recibir las últimas actualizaciones y funciones
fr: Mettez à jour l'application pour recevoir les dernières mises à jour et fonctionnalités
pt: Atualize o App para receber as últimas atualizações e funcionalidades

# dialogCongratsPremiumPlan
source: Welcome to Chaos IO Premium
es: Bienvenido/a a Chaos IO Premium
fr: Bienvenue dans Chaos IO Premium
pt: Boas-vindas ao Chaos IO Premium

# dialogCongratsPremiumPlanDescription
source: Thank you for believing in Chaos IO and investing in your knowledge!
es: ¡Gracias por confiar en Chaos IO e invertir en tu conocimiento!
fr: Merci de croire en Chaos IO et d'investir dans vos connaissances!
pt: Obrigado por acreditar no Chaos IO e investir no seu conhecimento!

# dialogUnableToValidatePremiumStatus
source: We couldn't verify if your subscription activation process has been completed yet. Please try again later.
es: 'Todavía no pudimos verificar si se ha completado el proceso de activación de tu suscripción. Por favor, inténtalo nuevamente más tarde.'
fr: Nous n'avons pas pu vérifier si le processus d'activation de votre abonnement a été terminé. Veuillez réessayer plus tard.
pt: 'Ainda não conseguimos verificar se o processo de ativação da sua assinatura já foi concluído. Por favor, tente novamente mais tarde.'

# dialogThereIsNoPurchaseToRestore
source: You don't have any subscriptions to restore. Subscribe to Chaos IO Premium to receive various benefits!
es: No tienes suscripciones para restaurar. ¡Suscríbete a Chaos IO Premium para recibir varios beneficios!
fr: Vous n'avez aucun abonnement à restaurer. Abonnez-vous à Chaos IO Premium pour bénéficier de nombreux avantages !
pt: Você não possui assinaturas para restaurar. Realize a assinatura do Chaos IO Premium para poder receber diversos benefícios!

# dialogUnableToMakeSubscriptionPurchase
source: Unfortunately, there was an issue trying to acquire your subscription, and we couldn't complete the payment process. Please try again later.
es: Desafortunadamente, hubo un problema al intentar adquirir tu suscripción y no pudimos completar el proceso de pago. Por favor, inténtalo nuevamente más tarde.
fr: Malheureusement, un problème est survenu lors de l'acquisition de votre abonnement et nous n'avons pas pu finaliser le processus de paiement. Veuillez réessayer plus tard.
pt: Infelizmente ocorreu um problema ao tentar adquirir a sua assinatura e não conseguimos completar o processo de pagamento. Por favor, tente novamente mais tarde.

# dialogToAccessPersonalizedSubjectsPremiumPlan
source: To access the creation of personalized subjects, subscribe to Chaos IO Premium
es: Para acceder a la creación de asignaturas personalizadas, suscríbete a Chaos IO Premium
fr: Pour accéder à la création de matières personnalisées, abonnez-vous à Chaos IO Premium
pt: Para ter acesso a criação de disciplinas personalizadas, assine o Chaos IO Premium

# studyPlanAddSubject
source: Add Subject
fr: Ajouter une Discipline
